Конфигурация/Documents/ПоручениеНаДвижениеЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоЦеннымБумагамПоПоручениям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводВсехАктивов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПередачиПоручений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезАгента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>7</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ПоручениеНаДвижениеЦенныхБумаг/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.КорзинаЦенныхБумаг = Истина;
		
	ПриЧтенииСозданииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// после записи теряются значения реквизитов, добавленных к т.ч. объекта
	Если ЭтаФорма.КорзинаЦенныхБумаг Тогда
		ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();
	КонецЕсли;
	
	ЗаполнитьПодтверждениеОперацииНаСервере();
	
	РаботаСДокументамиКлиентСервер.НастроитьВидимостьДекорацийСогласованияПорученияНаВыводАктивов(ЭтаФорма);
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперацииНаСервере();
		КонецЕсли;
	Иначе		
		РаботаСДокументамиКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.Дата >= РаботаСДокументами.ДатаНачалаПроверкиДатыИВремениПолученияДляПорученийНаДвижениеАктивов()
			И РаботаСДокументами.СчетДоверительногоУправленияПоЛицензииПоУправлениюЦеннымиБумагами(Объект.Дата, Объект.СчетДоверительногоУправления) 
			И Объект.ДатаИВремяПолучения = '00010101' Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана дата и время получения документа",,"Объект.ДатаИВремяПолучения",, Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоЦеннымБумагам",
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, ДепозитарныйСчет"))
	Тогда
		Объект.ДепозитарныйСчет = Неопределено;
	КонецЕсли;		
	
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РынокПриИзменении(Элемент)
	
	Если Объект.Рынок = ЭтаФорма.ТекущийРынок Тогда // ничего менять не нужно
		Возврат;
	КонецЕсли;
		
	Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	
	Если ЭтаФорма.ТекущийРынок <> ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.ПустаяСсылка") Тогда // подтверждения не требуются
		// если выбрана корзина ценных бумаг и добавлены строки корзины,
		// то после подтверждения очистим корзину
		ТребПодтверждение = Не ЭтаФорма.КорзинаЦенныхБумаг Или (ЭтаФорма.КорзинаЦенныхБумаг И Объект.ЦенныеБумаги.Количество() > 0);
		
		Если ТребПодтверждение Тогда
			Если Вопрос("Ценные бумаги и связанные с ними реквизиты будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда // возвращаем всё в зад
				Объект.Рынок = ЭтаФорма.ТекущийРынок;
				Возврат;
			Иначе
				РаботаСКорзинойЦенныхБумагКлиентСервер.ОчиститьРеквизиты(ЭтаФорма, Объект);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	ЭтаФорма.ТекущийРынок = Объект.Рынок;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводВсехАктивовПриИзменении(Элемент)
	
	Если Объект.ВыводВсехАктивов Тогда
		
		Если Вопрос("При установке флага 'Вывод всех активов' будут очищены:
					|	Тип задолженности,
					|	Депозитарный счет,
					|	Рынок,
					|	Валюта,
					|	таблица Ценные бумаги.
					|Продолжить?",
					РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
			Объект.ТипЗадолженности	= Неопределено;
			Объект.ДепозитарныйСчет	= Неопределено;
			Объект.Рынок			= Неопределено;
			Объект.Валюта			= Неопределено;
			
			Объект.ЦенныеБумаги.Очистить();
			
			РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьИтоговуюСтроку(Элементы.ИтоговаяСтрокаЦенныеБумаги, Объект.Рынок, Объект.ЦенныеБумаги);
			
		Иначе
			Объект.ВыводВсехАктивов = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	
	Если ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для вывода активов по договору ИИС используйте документ Поручение на вывод денежных средств и флаг Вывод всех активов", Объект,, "Объект.СчетДоверительногоУправления");
		Объект.СчетДоверительногоУправления = Неопределено;
		Возврат;
	КонецЕсли;	
	
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТребуетсяСогласованиеНажатие(Элемент)
	
	РаботаСДокументамиКлиентСервер.ПоказатьСкрытьКартуМаршрутаСогласованияПорученияНаВыводАктивов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСогласованоНажатие(Элемент)
	
	РаботаСДокументамиКлиентСервер.ПоказатьСкрытьКартуМаршрутаСогласованияПорученияНаВыводАктивов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтмененоНажатие(Элемент)
	
	РаботаСДокументамиКлиентСервер.ПоказатьСкрытьКартуМаршрутаСогласованияПорученияНаВыводАктивов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КартаСогласованияВыбор(Элемент)
		
	Если Элемент.ТекущийЭлемент.Значение = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.ТребуетсяПодтверждениеКлиентскогоОтдела")
		Или Элемент.ТекущийЭлемент.Значение = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.ПодтверждениеКлиентскогоОтдела") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поручение на вывод ценных бумаг не требует подтверждения клиентского отдела");
		
	ИначеЕсли Элемент.ТекущийЭлемент.Значение = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.ЭтоПоручениеНаВыводЦенныхБумаг") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поручение на вывод ценных бумаг: Да.");
		
	ИначеЕсли Элемент.ТекущийЭлемент.Значение = ПредопределенноеЗначение("БизнесПроцесс.СогласованиеПорученийНаВыводАктивов.ТочкаМаршрута.СогласованиеОтделомСопровожденияОпераций") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поручение на вывод ценных бумаг требует только прохождение контроля.");
		
	Иначе	
		РаботаСДокументамиКлиент.ПоказатьОбъектБизнесПроцессаСогласованияПорученийНаВыводАктивов(Объект.Ссылка, Элемент.ТекущийЭлемент.Значение);	
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ТипПередачиПриИзменении(Элемент)

	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗадолженностиПриИзменении(Элемент)
	
	Если Объект.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская") И Объект.ВыводВсехАктивов Тогда 
		Объект.ВыводВсехАктивов        = Ложь;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ТЧ_ЦЕННЫЕ_БУМАГИ

&НаКлиенте
Процедура ЦенныеБумагиПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьИтоговуюСтроку(Элементы.ИтоговаяСтрокаЦенныеБумаги, Объект.Рынок, Объект.ЦенныеБумаги);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиЦеннаяБумагаПриИзменении(Элемент)
	
	ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере(Элементы.ЦенныеБумаги.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСуммаПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "Сумма", Объект.Валюта);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенныеБумагиСуммаКупонаПриИзменении(Элемент)
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.Пересчитать(ЭтаФорма,, "СуммаКупона", Объект.Валюта);

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителя(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоЦеннымБумагам(ЭтаФорма,);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьЦенныеБумагиИКоличествоИзВывода(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран счет ДУ!",, "СчетДоверительногоУправления", "Объект.СчетДоверительногоУправления");
		Возврат;
	КонецЕсли;
	
	Если Объект.ЦенныеБумаги.Количество() > 0 Тогда
		Если Вопрос("Табличная часть будет очищена! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	СписокВыводов = РаботаСДокументами.СписокВыводовЦенныхБумагПоПрочимОрганизациям(Объект.Дата, Ложь, Истина);	
	Если СписокВыводов = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ВыводЦенныхБумаг = ОткрытьФормуМодально("ОбщаяФорма.ВыборИзСпискаСФильтрацией", Новый Структура("Список, Заголовок", СписокВыводов, "Выводы ценных бумаг"));
	
	Если ВыводЦенныхБумаг = Неопределено Или ВыводЦенныхБумаг = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЦенныеБумагиИКоличествоИзВыводаНаСервере(ВыводЦенныхБумаг);
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьИзОстатков(Команда)

	Если Объект.ЦенныеБумаги.Количество() > 0 Тогда
		Если Вопрос("Табличная часть будет очищена! Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьИзОстатковНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьИзФайлаExcel(Команда)
	
	Если Не (ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) 
		И ЗначениеЗаполнено(Объект.Рынок)
		И ЗначениеЗаполнено(Объект.ДепозитарныйСчет)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для загрузки необходимо указать счет доверительного управления, рынок и депозитарный счет");
		Возврат;
	КонецЕсли;
	
	Если Объект.ЦенныеБумаги.Количество() > 0
		И Вопрос("Перед заполнением табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да
	Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ЦенныеБумаги.Очистить();
	
	АдресВоВременномХранилище = РаботаСВнешнимиСистемамиКлиентСервер.ВыбратьФайлExcelИПоместитьВоВременноеХранилище(ЭтаФорма.УникальныйИдентификатор);
	
	Если АдресВоВременномХранилище <> Неопределено Тогда
		ЗаполнитьЦенныеБумагиИПартииПоДаннымФайлаExcelНаСервере(АдресВоВременномХранилище);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипЗадолженности = Неопределено;	
		Объект.ВыводВсехАктивов = Ложь;
	КонецЕсли;
	
	ЭтаФорма.ТекущийРынок = Объект.Рынок;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда	
		ЭтаФорма.ТипПередачи = РаботаСДокументами.ПолучитьТипПередачиДляВводаВыводаАктивов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Контрагент);                                              		
	КонецЕсли;
	
	Элементы.ЦенныеБумагиЦеннаяБумага.ОграничениеТипа = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(Объект.Рынок);
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьНоминалыЦенныхБумагИСуммыВсего(ЭтаФорма, Объект);
		
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	РаботаСДокументамиКлиентСервер.НастроитьВидимостьДекорацийСогласованияПорученияНаВыводАктивов(ЭтаФорма);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
		
КонецПроцедуры // ПриЧтенииСозданииНаСервере

&НаСервере
Процедура ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере(ИдСтрокиКорзины = Неопределено) Экспорт
	
	НомерСтрокиКорзины = ?(ИдСтрокиКорзины = Неопределено, Неопределено,
		Объект.ЦенныеБумаги.Индекс(Объект.ЦенныеБумаги.НайтиПоИдентификатору(ИдСтрокиКорзины)));
	
	РаботаСКорзинойЦенныхБумагКлиентСервер.ЗаполнитьНоминалыЦенныхБумагИСуммыВсего(ЭтаФорма, Объект,, НомерСтрокиКорзины);
	
КонецПроцедуры // ЗаполнитьРасчетныеПоляКорзиныЦенныхБумагНаСервере

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы 	  = Форма.Элементы;
	
	ВидимостьКонтрагента = РаботаСДокументамиКлиентСервер.ТребуетсяПроверкаЗаполненияЗначенияКонтрагента(ДанныеОбъекта);
	ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	СобственныйСчетДУ = (ВидДоговораДоверительногоУправления = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный"));
	
	Элементы.Контрагент.Видимость 					= ВидимостьКонтрагента;
	Элементы.Контрагент.АвтоОтметкаНезаполненного 	= РаботаСДокументамиКлиентСервер.ТребуетсяПроверкаЗаполненияЗначенияКонтрагента(ДанныеОбъекта);                    		
	Элементы.Контрагент.ТолькоПросмотр 				= Форма.ТипПередачи < 2 И Не СобственныйСчетДУ;
	
	Элементы.ТипПередачи.Видимость = ВидимостьКонтрагента И Не ДанныеОбъекта.ВыводВсехАктивов И Не СобственныйСчетДУ;                                                  	

	// в зависимости от рынка
	ЭтоРынокОблигаций = (ДанныеОбъекта.Рынок = ПредопределенноеЗначение("Перечисление.РынкиЦенныхБумаг.Облигации"));
	
	Элементы.ЦенныеБумагиСуммаКупона.Видимость = ЭтоРынокОблигаций;
	Элементы.ЦенныеБумагиСуммаВсего.Видимость  = ЭтоРынокОблигаций;
	
	// Вывод всех активов оставляем только для старых документов, т. к. это дублирующийся функционал с поручением на движение денежных средств (там работает корректнее)
	Элементы.ВыводВсехАктивов.Видимость = Не ВидимостьКонтрагента;
	
	ВыводВсехАктивов = ДанныеОбъекта.ВыводВсехАктивов;
	
	Элементы.ГруппаШапкаФормыКолонка2.Видимость										= НЕ ВыводВсехАктивов;
	Элементы.Рынок.Видимость														= НЕ ВыводВсехАктивов;
	Элементы.Валюта.Видимость														= НЕ ВыводВсехАктивов;
	Элементы.ЦенныеБумаги.Видимость													= НЕ ВыводВсехАктивов;
	Элементы.ИтоговаяСтрокаЦенныеБумаги.Видимость									= НЕ ВыводВсехАктивов;
	Элементы.ЦенныеБумагиКомандаЗаполнитьЦенныеБумагиИКоличествоИзВывода.Видимость 	= ДанныеОбъекта.ТипЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.Дебиторская");
	
КонецПроцедуры // НастроитьВидимостьИДоступность

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()

	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзОстатковНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕСТЬNULL(ОстаткиЦенныхБумагОстатки.КоличествоОстаток, 0) КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиЦенныхБумаг.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ДепозитарныйСчет = &ДепозитарныйСчет
		|				И Рынок = &Рынок) КАК ОстаткиЦенныхБумагОстатки";
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.УстановитьПараметр("Период", Новый Граница(Новый МоментВремени(Объект.Дата, Объект.Ссылка), ВидГраницы.Исключая));
	Иначе
		Запрос.УстановитьПараметр("Период", Неопределено);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДепозитарныйСчет",             Объект.ДепозитарныйСчет);
	Запрос.УстановитьПараметр("Рынок",                        Объект.Рынок);
	
	Объект.ЦенныеБумаги.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦенныеБумагиИКоличествоИзВыводаНаСервере(ВыводЦенныхБумаг)
	
	РаботаСДокументами.ЗаполнитьЦенныеБумагиИКоличествоИзВыводаЦенныхБумаг(ЭтаФорма.Объект, ВыводЦенныхБумаг, Ложь);
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьЦенныеБумагиИПартииПоДаннымФайлаExcelНаСервере(АдресВоВременномХранилище)

	ОбъектДокумента = РеквизитФормыВЗначение("Объект");
	РаботаСЦеннымиБумагами.ЗаполнитьЦенныеБумагиИПартииПоДаннымФайлаExcel(ОбъектДокумента, АдресВоВременномХранилище);
	ЗначениеВРеквизитФормы(ОбъектДокумента, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

#КонецОбласти
